{"keras_version": "1.1.1", "config": {"output_layers": [["dense_3", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 7, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "name": "convolution2d_1", "trainable": true, "W_constraint": null, "nb_col": 7, "border_mode": "same", "nb_filter": 16}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_2", "trainable": true, "W_constraint": null, "nb_col": 5, "border_mode": "same", "nb_filter": 64}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "Dropout", "config": {"p": 0.8, "name": "dropout_1", "trainable": true}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "dropout_1"}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "glorot_uniform", "subsample": [2, 2], "name": "convolution2d_3", "trainable": true, "W_constraint": null, "nb_col": 5, "border_mode": "same", "nb_filter": 128}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "name": "dense_1", "W_constraint": null, "b_regularizer": null, "output_dim": 512, "input_dim": null}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"p": 0.8, "name": "dropout_2", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "name": "dense_2", "W_constraint": null, "b_regularizer": null, "output_dim": 32, "input_dim": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_2"}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "name": "dense_3", "W_constraint": null, "b_regularizer": null, "output_dim": 1, "input_dim": null}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dense_3"}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "class_name": "Model"}