{"config": {"output_layers": [["dense_4", 0, 0]], "name": "model_2", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false}}, {"name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block1_conv1", "trainable": false, "W_constraint": null, "nb_filter": 64, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block1_conv2", "trainable": false, "W_constraint": null, "nb_filter": 64, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block2_conv1", "trainable": false, "W_constraint": null, "nb_filter": 128, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block2_conv2", "trainable": false, "W_constraint": null, "nb_filter": 128, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block3_conv1", "trainable": false, "W_constraint": null, "nb_filter": 256, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block3_conv2", "trainable": false, "W_constraint": null, "nb_filter": 256, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block3_conv3", "trainable": false, "W_constraint": null, "nb_filter": 256, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block4_conv1", "trainable": false, "W_constraint": null, "nb_filter": 512, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block4_conv2", "trainable": false, "W_constraint": null, "nb_filter": 512, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block4_conv3", "trainable": false, "W_constraint": null, "nb_filter": 512, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": false, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block5_conv1", "trainable": false, "W_constraint": null, "nb_filter": 512, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block5_conv2", "trainable": false, "W_constraint": null, "nb_filter": 512, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "activation": "relu", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "bias": true, "b_regularizer": null, "name": "block5_conv3", "trainable": false, "W_constraint": null, "nb_filter": 512, "nb_col": 3, "nb_row": 3, "init": "glorot_uniform"}}, {"name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0]]], "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": false, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"name": "flatten_1", "inbound_nodes": [[["block5_pool", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": false}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1024, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "dense_1", "trainable": true, "W_constraint": null, "activation": "relu"}}, {"name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.6}}, {"name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 256, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "dense_2", "trainable": true, "W_constraint": null, "activation": "relu"}}, {"name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 32, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "dense_3", "trainable": true, "W_constraint": null, "activation": "relu"}}, {"name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "dense_4", "trainable": true, "W_constraint": null, "activation": "linear"}}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.1.1", "class_name": "Model"}